Python 3.13.2 (tags/v3.13.2:4f8bb39, Feb  4 2025, 15:23:48) [MSC v.1942 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

================= RESTART: D:/00-Learning/Python/Lesstion03.py =================
------------ โปรแกรมคำนวณกระเบื้อง by Pha ---------------
คุณต้องการปูกระเบื้องทั้งหมดกี่แผ่น : 152323
1 แถวต้องปูกระเบื้องกี่แผ่น : 25
----------------- Calulate -------------
มีกระเบื้องทั้งหมด : 152323 แผ่น
1 แถวปูกระเบื้องได้ : 25 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  6092  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  23  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  2  แผ่น
ลูกค้าต้องจ่ายเงิน  4569750  บาท

= RESTART: D:/00-Learning/Python/Lesstion03.py
------------ โปรแกรมคำนวณกระเบื้อง by Pha ---------------
คุณต้องการปูกระเบื้องทั้งหมดกี่แผ่น : 1890
1 แถวต้องปูกระเบื้องกี่แผ่น : 40
----------------- Calulate -------------
มีกระเบื้องทั้งหมด : 1890 แผ่น
1 แถวปูกระเบื้องได้ : 40 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  47  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  10  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  30  แผ่น
ลูกค้าต้องจ่ายเงิน  57600  บาท
>>> 
= RESTART: D:/00-Learning/Python/Lesstion03.py
------------ โปรแกรมคำนวณกระเบื้อง by Pha ---------------
คุณต้องการปูกระเบื้องทั้งหมดกี่แผ่น : 1890
1 แถวต้องปูกระเบื้องกี่แผ่น : 42
----------------- Calulate -------------
มีกระเบื้องทั้งหมด : 1890 แผ่น
1 แถวปูกระเบื้องได้ : 42 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  45  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  0  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  42  แผ่น
ลูกค้าต้องจ่ายเงิน  57960  บาท
