Python 3.13.2 (tags/v3.13.2:4f8bb39, Feb  4 2025, 15:23:48) [MSC v.1942 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
3+2
5
3*2
6
3/2
1.5
3**2
9
3//2
1
3%2
1
10/3
3.3333333333333335
10%1
0
10%3
1
10//3
3

= RESTART: D:/00-Learning/Python/Lesstion03.py

= RESTART: D:/00-Learning/Python/Lesstion03.py
1 3

= RESTART: D:/00-Learning/Python/Lesstion03.py

= RESTART: D:/00-Learning/Python/Lesstion03.py
มีกระเบื้องทั้งหมด : 10 แผ่น
1 แถวปูกระเบื้องได้ : 3 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  3  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  1  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  2  แผ่น

= RESTART: D:/00-Learning/Python/Lesstion03.py
มีกระเบื้องทั้งหมด : 100 แผ่น
1 แถวปูกระเบื้องได้ : 13 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  7  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  9  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  4  แผ่น

= RESTART: D:/00-Learning/Python/Lesstion03.py
มีกระเบื้องทั้งหมด : 10000 แผ่น
1 แถวปูกระเบื้องได้ : 3 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  3333  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  1  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  2  แผ่น

= RESTART: D:/00-Learning/Python/Lesstion03.py
มีกระเบื้องทั้งหมด : 12540 แผ่น
1 แถวปูกระเบื้องได้ : 3 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  4180  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  0  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  3  แผ่น
>>> 
= RESTART: D:/00-Learning/Python/Lesstion03.py
มีกระเบื้องทั้งหมด : 12540 แผ่น
1 แถวปูกระเบื้องได้ : 20 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  627  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  0  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  20  แผ่น
>>> 
= RESTART: D:/00-Learning/Python/Lesstion03.py
มีกระเบื้องทั้งหมด : 10 แผ่น
1 แถวปูกระเบื้องได้ : 3 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  3  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  1  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  2  แผ่น
>>> 
= RESTART: D:/00-Learning/Python/Lesstion03.py
มีกระเบื้องทั้งหมด : 1456 แผ่น
1 แถวปูกระเบื้องได้ : 53 แผ่น
***--------คำนวณ----------***
ต้องปูกระเบื้องทั้งหมด  27  แถว
เหลือกระเบื้องที่ยังไม่ได้ปู  25  แผ่น
ลูกค้าต้องซื้อกระเบื้องเพิ่ม  28  แผ่น
